export const firstFilter: string[] = [
    "Помогу",
    "Сделаю",
    "Являюсь",
    "Закончил курсы",
    "Настрою",
    "Запущу",
    "Создам",
    "Создадим",
    "#Помогу",
    "Помогу",
    "Выстроим",
    "Выстрою",
    "Обеспечу",
    "Обеспечим"
];


export const contactFilter : string[] = [
    '+7',
    '@',
    'http',
    'www'
]

export const ignoreWordsFilter: string[] = [
    "Бесплатно",
    "Диагностика",
    "Диагностики",
    "Диагностику",
    "Консультация",
    "Консультацию",
    "Безоплатно",
    "Без оплаты",
    "Разбор",
    "Слова",
    "Нарк",
    "Нарко",
    "Курьер",
    "Крипта",
    "Крипту",
    "Кошелек",
    "Дроп",
    "Дропы",
    "Карта",
    "Карты",
    "Вакансия",
    "Зарплата",
    "Требуется",
    "Отклик",
    "Откликнуться",
    "Присылай",
    "Пришли",
    "Заполни",
    "Анкету",
    "Анкета",
    "Фикс",
    "Форма",
    "Форму",
    "Почасовая",
    "Компанию",
    "Компания",
    "Ежедневно",
    "Отправить",
    "Отправляйте",
    "Кандидат",
    "График",
    "Руководителю",
    "Должность",
    "Коллектив"
];

export function containsKeywords(message: string, keywords: string[]): boolean {
    for (const keyword of keywords) {
        if (message.toLowerCase().includes(keyword.toLowerCase())) {
            return true;
        }
    }
    return false;
}
